Revit 2027 API
IFCAggregate.Delete Method
 Delete the aggregate object from the IFCFile model.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Delete()
Public Sub Delete
public:
void Delete()
member Delete : unit -> unit
See Also
Reference
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace